Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	АктуальнаяУчетнаяПолитика = ПолучитьАктуальнуюУчетнуюПолитику();
	Если ЭтотОбъект.УчетнаяПолитика <> АктуальнаяУчетнаяПолитика Тогда
		Отказ = Истина;
		Сообщить("Учетная политика, указанная в шапке документа, не соответствует актуальной учетной политике.");		
		Возврат;		
	КонецЕсли;	
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;                 
	Движения.ОстаткиНоменклатуры.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК Поле1,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК Поле2
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|				&Момент,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)) КАК ОстаткиНоменклатурыОстатки
	|		ПО Товары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Партия УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(Поле2)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если УчетнаяПолитика = Перечисления.УчетнаяПолитика.ФИФО Тогда
      Запрос.Текст = СтрЗаменить(Запрос.Текст,"УБЫВ", "ВОЗР");   
	  СортировкаСогласноУчетнойПолитике = "ВОЗР";
		КонецЕсли;
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если НЕ ВыборкаНоменклатура.Номенклатура.Услуга и ВыборкаНоменклатура.Поле2 < ВыборкаНоменклатура.Количество Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает " + Строка(ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.Поле2) + " единиц номенклатуры " + ВыборкаНоменклатура.Номенклатура + ". Проведение невозможно.";
Сообщение.Сообщить();
			Отказ = Истина;
			продолжить;
		КонецЕсли;
	
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
		
		ОсталосьСписать = ВыборкаНоменклатура.Количество;
	           	
		Пока ВыборкаДетальныеЗаписи.Следующий() И Не Отказ Цикл
			
			Если ВыборкаДетальныеЗаписи.Поле2<=ОсталосьСписать Тогда
				КоличествоСп = ВыборкаДетальныеЗаписи.Поле2;
				СуммаСп = ВыборкаДетальныеЗаписи.Поле1;
			Иначе
				КоличествоСп = ОсталосьСписать;
				СуммаСп = ВыборкаДетальныеЗаписи.Поле1/
				ВыборкаДетальныеЗаписи.Поле2*ОсталосьСписать;
			КонецЕсли;
			
		 	
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Партия = ВыборкаДетальныеЗаписи.Партия;                       
		Движение.Количество = КоличествоСп;
		Движение.Сумма = СуммаСп;
			
			ОсталосьСписать = ОсталосьСписать - КоличествоСп;
			              
						
		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры




Функция ПолучитьСписокНоменклатурСогласноУчетнойПолитике(ИсключаемаяПартия, Номенклатура)
	// Получить текстовое представление параметра сортировки запроса
	СортировкаСогласноУчетнойПолитике = "";
	Если УчетнаяПолитика = Перечисления.УчетнаяПолитика.ЛИФО Тогда
		СортировкаСогласноУчетнойПолитике = "УБЫВ";
	ИначеЕсли УчетнаяПолитика = Перечисления.УчетнаяПолитика.ФИФО Тогда
		СортировкаСогласноУчетнойПолитике = "ВОЗР";
	Иначе
		ВызватьИсключение("Неизвестное значение учетной политики.");
	КонецЕсли;
	
	// Получить данные
	Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|  	ОстаткиНоменклатурыОстатки.Партия КАК Партия,        	
			|	ОстаткиНоменклатурыОстатки.Партия.Дата КАК ПартияДата,
			|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток,
			|	ОстаткиНоменклатурыОстатки.НомерСтрокиПартии КАК НомерСтрокиПартии 
			|ИЗ
			|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
			|		,
			|		Партия <> &Партия
			|			И Номенклатура = &Номенклатура) КАК ОстаткиНоменклатурыОстатки
			|ГДЕ 
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПартияДата " + СортировкаСогласноУчетнойПолитике + ",
			|	НомерСтрокиПартии";
	Запрос.УстановитьПараметр("Партия", ИсключаемаяПартия);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	
	Возврат Выборка;
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 		
		Партия = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ОбновитьУчетнуюПолитикуДокумента();
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	ОбновитьУчетнуюПолитикуДокумента();
КонецПроцедуры


Процедура ОбновитьУчетнуюПолитикуДокумента()
	ЭтотОбъект.УчетнаяПолитика = ПолучитьАктуальнуюУчетнуюПолитику();
КонецПроцедуры


Функция ПолучитьАктуальнуюУчетнуюПолитику()
	Возврат РегистрыСведений.МетодСписания.ПолучитьПоследнее(Дата).МетодСписания;
КонецФункции
 


    
