
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МетодСписания
	Движения.МетодСписания.Записывать = Истина;
	Движение = Движения.МетодСписания.Добавить();
	Движение.Период = Дата;
	Движение.МетодСписания = МетодСписания;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоГода(Дата);
КонецПроцедуры

