&НаСервере
Функция Войти(Емейл, ПарольныйХеш) Экспорт
	Контрагент = ПроверитьДанныеВхода(Емейл, ПарольныйХеш);
	Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Возврат ПланыОбмена.МобильныйОбмен.ПустаяСсылка();
	КонецЕсли;	        
	
	Возврат СоздатьНовыйУзелМобильногоПриложения(Контрагент);	
КонецФункции	   

&НаСервере
Функция ПроверитьДанныеВхода(Емейл, ПарольныйХеш)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Email = &Емейл
		|	И Контрагенты.ПарольныйХеш = &ПарольныйХеш";
	
	Запрос.УстановитьПараметр("Емейл", Емейл);
	Запрос.УстановитьПараметр("ПарольныйХеш", ПарольныйХеш);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Выборка.КонтрагентСсылка;
КонецФункции        

&НаСервере
Функция СоздатьНовыйУзелМобильногоПриложения(Контрагент)
	НовыйУзел = ПланыОбмена.МобильныйОбмен.СоздатьУзел();  
	НовыйУзел.УстановитьНовыйКод();
	НовыйУзел.Наименование = НовыйУзел.Код;
	НовыйУзел.Контрагент = Контрагент;
	НовыйУзел.Записать();
	Возврат НовыйУзел.Ссылка;
КонецФункции 



&НаСервере
Функция Выйти(Узел) Экспорт
	УдалитьУзелМобильногоПриложения(Узел);	
КонецФункции

&НаСервере
Функция УдалитьУзелМобильногоПриложения(Узел)
	Узел.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
КонецФункции